rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_EIM_1.h
#define EIM_1_EICHD1_WORD4_B12_15DATA_MASK_MASK  (0xFFFFFFFFU)
#define EIM_1_EICHD1_WORD4_B12_15DATA_MASK_SHIFT (0U)
#define EIM_1_EICHD1_WORD4_B12_15DATA_MASK_WIDTH (32U)
#define EIM_1_EICHD1_WORD4_B12_15DATA_MASK(x)    (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD1_WORD4_B12_15DATA_MASK_SHIFT)) & EIM_1_EICHD1_WORD4_B12_15DATA_MASK_MASK)
/*! @} */

/*! @name EICHD2_WORD0 - Error Injection Channel Descriptor 2, Word0 */
/*! @{ */

#define EIM_1_EICHD2_WORD0_CHKBIT_MASK_MASK      (0xFFFFFFF0U)
#define EIM_1_EICHD2_WORD0_CHKBIT_MASK_SHIFT     (4U)
#define EIM_1_EICHD2_WORD0_CHKBIT_MASK_WIDTH     (28U)
#define EIM_1_EICHD2_WORD0_CHKBIT_MASK(x)        (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD2_WORD0_CHKBIT_MASK_SHIFT)) & EIM_1_EICHD2_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD2_WORD1 - Error Injection Channel Descriptor 2, Word1 */
/*! @{ */

#define EIM_1_EICHD2_WORD1_B0_3DATA_MASK_MASK    (0xFFU)
#define EIM_1_EICHD2_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_1_EICHD2_WORD1_B0_3DATA_MASK_WIDTH   (8U)
#define EIM_1_EICHD2_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD2_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_1_EICHD2_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD2_WORD2 - Error Injection Channel Descriptor 2, Word2 */
/*! @{ */

#define EIM_1_EICHD2_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_1_EICHD2_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_1_EICHD2_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_1_EICHD2_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD2_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_1_EICHD2_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD2_WORD3 - Error Injection Channel Descriptor 2, Word3 */
/*! @{ */

#define EIM_1_EICHD2_WORD3_B8_11DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_1_EICHD2_WORD3_B8_11DATA_MASK_SHIFT  (0U)
#define EIM_1_EICHD2_WORD3_B8_11DATA_MASK_WIDTH  (32U)
#define EIM_1_EICHD2_WORD3_B8_11DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD2_WORD3_B8_11DATA_MASK_SHIFT)) & EIM_1_EICHD2_WORD3_B8_11DATA_MASK_MASK)
/*! @} */

/*! @name EICHD2_WORD4 - Error Injection Channel Descriptor 2, Word4 */
/*! @{ */

#define EIM_1_EICHD2_WORD4_B12_15DATA_MASK_MASK  (0xFFFFFFFFU)
#define EIM_1_EICHD2_WORD4_B12_15DATA_MASK_SHIFT (0U)
#define EIM_1_EICHD2_WORD4_B12_15DATA_MASK_WIDTH (32U)
#define EIM_1_EICHD2_WORD4_B12_15DATA_MASK(x)    (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD2_WORD4_B12_15DATA_MASK_SHIFT)) & EIM_1_EICHD2_WORD4_B12_15DATA_MASK_MASK)
/*! @} */

/*! @name EICHD3_WORD0 - Error Injection Channel Descriptor 3, Word0 */
/*! @{ */

#define EIM_1_EICHD3_WORD0_CHKBIT_MASK_MASK      (0xFFFFFFF0U)
#define EIM_1_EICHD3_WORD0_CHKBIT_MASK_SHIFT     (4U)
#define EIM_1_EICHD3_WORD0_CHKBIT_MASK_WIDTH     (28U)
#define EIM_1_EICHD3_WORD0_CHKBIT_MASK(x)        (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD3_WORD0_CHKBIT_MASK_SHIFT)) & EIM_1_EICHD3_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD3_WORD1 - Error Injection Channel Descriptor 3, Word1 */
/*! @{ */

#define EIM_1_EICHD3_WORD1_B0_3DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_1_EICHD3_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_1_EICHD3_WORD1_B0_3DATA_MASK_WIDTH   (32U)
#define EIM_1_EICHD3_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD3_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_1_EICHD3_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD3_WORD2 - Error Injection Channel Descriptor 3, Word2 */
/*! @{ */

#define EIM_1_EICHD3_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_1_EICHD3_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_1_EICHD3_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_1_EICHD3_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD3_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_1_EICHD3_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD3_WORD3 - Error Injection Channel Descriptor 3, Word3 */
/*! @{ */

#define EIM_1_EICHD3_WORD3_B8_11DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_1_EICHD3_WORD3_B8_11DATA_MASK_SHIFT  (0U)
#define EIM_1_EICHD3_WORD3_B8_11DATA_MASK_WIDTH  (32U)
#define EIM_1_EICHD3_WORD3_B8_11DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD3_WORD3_B8_11DATA_MASK_SHIFT)) & EIM_1_EICHD3_WORD3_B8_11DATA_MASK_MASK)
/*! @} */

/*! @name EICHD3_WORD4 - Error Injection Channel Descriptor 3, Word4 */
/*! @{ */

#define EIM_1_EICHD3_WORD4_B12_15DATA_MASK_MASK  (0xFFFFFFFFU)
#define EIM_1_EICHD3_WORD4_B12_15DATA_MASK_SHIFT (0U)
#define EIM_1_EICHD3_WORD4_B12_15DATA_MASK_WIDTH (32U)
#define EIM_1_EICHD3_WORD4_B12_15DATA_MASK(x)    (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD3_WORD4_B12_15DATA_MASK_SHIFT)) & EIM_1_EICHD3_WORD4_B12_15DATA_MASK_MASK)
/*! @} */

/*! @name EICHD4_WORD0 - Error Injection Channel Descriptor 4, Word0 */
/*! @{ */

#define EIM_1_EICHD4_WORD0_CHKBIT_MASK_MASK      (0xFFFFFFF0U)
#define EIM_1_EICHD4_WORD0_CHKBIT_MASK_SHIFT     (4U)
#define EIM_1_EICHD4_WORD0_CHKBIT_MASK_WIDTH     (28U)
#define EIM_1_EICHD4_WORD0_CHKBIT_MASK(x)        (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD4_WORD0_CHKBIT_MASK_SHIFT)) & EIM_1_EICHD4_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD4_WORD1 - Error Injection Channel Descriptor 4, Word1 */
/*! @{ */

#define EIM_1_EICHD4_WORD1_B0_3DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_1_EICHD4_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_1_EICHD4_WORD1_B0_3DATA_MASK_WIDTH   (32U)
#define EIM_1_EICHD4_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD4_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_1_EICHD4_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD4_WORD2 - Error Injection Channel Descriptor 4, Word2 */
/*! @{ */

#define EIM_1_EICHD4_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_1_EICHD4_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_1_EICHD4_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_1_EICHD4_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD4_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_1_EICHD4_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD4_WORD3 - Error Injection Channel Descriptor 4, Word3 */
/*! @{ */

