rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_EIM_1.h
#define EIM_1_EICHD4_WORD3_B8_11DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_1_EICHD4_WORD3_B8_11DATA_MASK_SHIFT  (0U)
#define EIM_1_EICHD4_WORD3_B8_11DATA_MASK_WIDTH  (32U)
#define EIM_1_EICHD4_WORD3_B8_11DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD4_WORD3_B8_11DATA_MASK_SHIFT)) & EIM_1_EICHD4_WORD3_B8_11DATA_MASK_MASK)
/*! @} */

/*! @name EICHD4_WORD4 - Error Injection Channel Descriptor 4, Word4 */
/*! @{ */

#define EIM_1_EICHD4_WORD4_B12_15DATA_MASK_MASK  (0xFFFFFFFFU)
#define EIM_1_EICHD4_WORD4_B12_15DATA_MASK_SHIFT (0U)
#define EIM_1_EICHD4_WORD4_B12_15DATA_MASK_WIDTH (32U)
#define EIM_1_EICHD4_WORD4_B12_15DATA_MASK(x)    (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD4_WORD4_B12_15DATA_MASK_SHIFT)) & EIM_1_EICHD4_WORD4_B12_15DATA_MASK_MASK)
/*! @} */

/*! @name EICHD10_WORD0 - Error Injection Channel Descriptor 10, Word0 */
/*! @{ */

#define EIM_1_EICHD10_WORD0_CHKBIT_MASK_MASK     (0xFF000000U)
#define EIM_1_EICHD10_WORD0_CHKBIT_MASK_SHIFT    (24U)
#define EIM_1_EICHD10_WORD0_CHKBIT_MASK_WIDTH    (8U)
#define EIM_1_EICHD10_WORD0_CHKBIT_MASK(x)       (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD10_WORD0_CHKBIT_MASK_SHIFT)) & EIM_1_EICHD10_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD10_WORD1 - Error Injection Channel Descriptor 10, Word1 */
/*! @{ */

#define EIM_1_EICHD10_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_1_EICHD10_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_1_EICHD10_WORD1_B0_3DATA_MASK_WIDTH  (32U)
#define EIM_1_EICHD10_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD10_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_1_EICHD10_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD10_WORD2 - Error Injection Channel Descriptor 10, Word2 */
/*! @{ */

#define EIM_1_EICHD10_WORD2_B4_7DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_1_EICHD10_WORD2_B4_7DATA_MASK_SHIFT  (0U)
#define EIM_1_EICHD10_WORD2_B4_7DATA_MASK_WIDTH  (32U)
#define EIM_1_EICHD10_WORD2_B4_7DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD10_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_1_EICHD10_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD11_WORD0 - Error Injection Channel Descriptor 11, Word0 */
/*! @{ */

#define EIM_1_EICHD11_WORD0_CHKBIT_MASK_MASK     (0xFF000000U)
#define EIM_1_EICHD11_WORD0_CHKBIT_MASK_SHIFT    (24U)
#define EIM_1_EICHD11_WORD0_CHKBIT_MASK_WIDTH    (8U)
#define EIM_1_EICHD11_WORD0_CHKBIT_MASK(x)       (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD11_WORD0_CHKBIT_MASK_SHIFT)) & EIM_1_EICHD11_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD11_WORD1 - Error Injection Channel Descriptor 11, Word1 */
/*! @{ */

#define EIM_1_EICHD11_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_1_EICHD11_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_1_EICHD11_WORD1_B0_3DATA_MASK_WIDTH  (32U)
#define EIM_1_EICHD11_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD11_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_1_EICHD11_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD12_WORD0 - Error Injection Channel Descriptor 12, Word0 */
/*! @{ */

#define EIM_1_EICHD12_WORD0_CHKBIT_MASK_MASK     (0xFF000000U)
#define EIM_1_EICHD12_WORD0_CHKBIT_MASK_SHIFT    (24U)
#define EIM_1_EICHD12_WORD0_CHKBIT_MASK_WIDTH    (8U)
#define EIM_1_EICHD12_WORD0_CHKBIT_MASK(x)       (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD12_WORD0_CHKBIT_MASK_SHIFT)) & EIM_1_EICHD12_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD12_WORD1 - Error Injection Channel Descriptor 12, Word1 */
/*! @{ */

#define EIM_1_EICHD12_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_1_EICHD12_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_1_EICHD12_WORD1_B0_3DATA_MASK_WIDTH  (32U)
#define EIM_1_EICHD12_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD12_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_1_EICHD12_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD16_WORD1 - Error Injection Channel Descriptor 16, Word1 */
/*! @{ */

#define EIM_1_EICHD16_WORD1_B0_3DATA_MASK_MASK   (0x3FFFFFFFU)
#define EIM_1_EICHD16_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_1_EICHD16_WORD1_B0_3DATA_MASK_WIDTH  (30U)
#define EIM_1_EICHD16_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD16_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_1_EICHD16_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD17_WORD1 - Error Injection Channel Descriptor 17, Word1 */
/*! @{ */

#define EIM_1_EICHD17_WORD1_B0_3DATA_MASK_MASK   (0xFFFFFFFU)
#define EIM_1_EICHD17_WORD1_B0_3DATA_MASK_SHIFT  (0U)
#define EIM_1_EICHD17_WORD1_B0_3DATA_MASK_WIDTH  (28U)
#define EIM_1_EICHD17_WORD1_B0_3DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD17_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_1_EICHD17_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD17_WORD2 - Error Injection Channel Descriptor 17, Word2 */
/*! @{ */

#define EIM_1_EICHD17_WORD2_B4_7DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_1_EICHD17_WORD2_B4_7DATA_MASK_SHIFT  (0U)
#define EIM_1_EICHD17_WORD2_B4_7DATA_MASK_WIDTH  (32U)
#define EIM_1_EICHD17_WORD2_B4_7DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD17_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_1_EICHD17_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group EIM_1_Register_Masks */

/*!
 * @}
 */ /* end of group EIM_1_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K37_EIM_1_H_) */
